///二进制手表顶部有 4 个 LED 代表 小时（0-11），底部的 6 个 LED 代表 分钟（0-59）。
pub fn read_binary_watch(num: i32) -> Vec<String> {
    let hours = vec![
        vec!["0"],
        vec!["1", "2", "4", "8"],
        vec!["3", "5", "6", "9", "10"],
        vec!["7", "11"],
    ];
    let seconds = vec![
        vec!["00"],
        vec!["01", "02", "04", "08", "16", "32"],
        vec![
            "03", "05", "06", "09", "10", "12", "17", "18", "20", "24", "33", "34", "36", "40",
            "48",
        ],
        vec![
            "07", "11", "13", "14", "19", "21", "22", "25", "26", "28", "35", "37", "38", "41",
            "42", "44", "49", "50", "52", "56",
        ],
        vec![
            "15", "23", "27", "29", "30", "39", "43", "45", "46", "51", "53", "54", "57", "58",
        ],
        vec!["31", "47", "55", "59"],
    ];
    let mut res = vec![];
    let num = num as usize;
    for i in 0..hours.len() {
        if num >= i && num - i < seconds.len() {
            for &h in &hours[i] {
                for &s in &seconds[num - i] {
                    res.push(format!("{}:{}", h, s));
                }
            }
        }
    }
    res
}
